Revit 2024 API
ElectricalSystem.IsBasePanelFeedThroughLugsOccupied Property
 Checks if the feed through lugs of the base panel is already occupied.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public bool IsBasePanelFeedThroughLugsOccupied { get; }
Visual Basic
Public ReadOnly Property IsBasePanelFeedThroughLugsOccupied As Boolean
	Get
Visual C++
public:
property bool IsBasePanelFeedThroughLugsOccupied {
	bool get ();
}
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace